In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame()

In [3]:
print(df)

Empty DataFrame
Columns: []
Index: []

In [4]:
data = [[1, 5, 10, 15], [3, 6, 9, 12], [2, 4, 6, 8]]
df1 = pd.DataFrame(data)

In [5]:
df1

   0  1   2   3
0  1  5  10  15
1  3  6   9  12
2  2  4   6   8

In [6]:
df1.head(2)

   0  1   2   3
0  1  5  10  15
1  3  6   9  12

In [7]:
df1.tail(1)

   0  1  2  3
2  2  4  6  8

In [8]:
df1.shape

(3, 4)

In [9]:
df1.iloc[0:2,1:3]

   1   2
0  5  10
1  6   9

In [10]:
df1 = pd.DataFrame(data, index = ['A', 'B', 'C'], columns = ['a', 'b', 'c', 'd'])

In [11]:
df1

   a  b   c   d
A  1  5  10  15
B  3  6   9  12
C  2  4   6   8

In [12]:
data = {'Name': ['Manshi', 'Prince', 'Jeet'], 'Age': [19, 19, 20]}
df2 = pd.DataFrame(data)

In [13]:
df2

     Name  Age
0  Manshi   19
1  Prince   19
2    Jeet   20

In [14]:
data = [{'Name':'Manshi', 'Marks':90}, {'Name':'Prince', 'Marks': 92}, {'Name':'Jeet', 'Marks': 93}]
df3 = pd.DataFrame(data , index = ['stud 1', 'stud 2', 'stud 3'])

In [15]:
df3

          Name  Marks
stud 1  Manshi     90
stud 2  Prince     92
stud 3    Jeet     93

In [16]:
data = {'Manshi': pd.Series([92, 91, 95], index = ['M1', 'M2', 'M3']), 'Prince': pd.Series([93, 90, 96], index = ['M1', 'M2', 'M3'])}
df4 = pd.DataFrame(data)

In [17]:
df4

    Manshi  Prince
M1      92      93
M2      91      90
M3      95      96

In [18]:
df4['Jeet'] = pd.Series([91, 94, 92], index = ['M1', 'M2', 'M3'])

In [19]:
df4

    Manshi  Prince  Jeet
M1      92      93    91
M2      91      90    94
M3      95      96    92

In [20]:
del df4['Manshi']

In [21]:
df4

    Prince  Jeet
M1      93    91
M2      90    94
M3      96    92

In [22]:
df4.loc['M2']

Prince    90
Jeet      94
Name: M2, dtype: int64

In [23]:
df4.iloc[1]

Prince    90
Jeet      94
Name: M2, dtype: int64

# READING CSV FILE

In [24]:
df = pd.read_csv('data1.csv')
df

,Symbol,Open,High,Low,Last Traded Price,Change,%Change,Traded Volume(lacs),Traded Value(crs),52 Week High,52 Week Low,365 Days % Change,30 Days % Change
0,NIFTY 50,"18,435.15","18,473.35","18,162.75","18,199.10",-186.20,-1.01,"1,875.91","17,223.33","18,887.60","15,183.40",9.54,0.22
1,DIVISLAB,"3,355.00","3,529.50","3,351.55","3,515.00",163.45,4.88,14.55,505.62,"4,708.75","3,195.15",-20.27,7.63
2,CIPLA,"1,096.10","1,130.00","1,085.65","1,129.50",38.35,3.51,32.25,358.01,"1,180.10",860,26.37,2.27
3,APOLLOHOSP,"4,610.80","4,788.45","4,602.20","4,750.00",153.35,3.34,8.77,414.04,"5,141.50","3,361.55",0.96,7.49
4,SUNPHARMA,992,"1,009.50",988.4,"1,009.45",21.10,2.13,20.44,204.59,"1,058.30",753.05,32.14,0.63
5,DRREDDY,"4,379.95","4,435.00","4,353.40","4,413.00",43.25,0.99,3.48,153.36,"4,931.05","3,654.00",-3.24,1.45
6,HCLTECH,"1,035.00","1,053.25","1,035.00","1,038.50",8.80,0.85,28.79,299.8,"1,359.40",877.35,-10.47,-5.20
7,TECHM,"1,024.50","1,030.55","1,020.25","1,025.00",7.05,0.69,20.38,209.1,"1,838.00",943.7,-35.86,-1.69
8,NESTLEIND,"20,165.00","20,348.00","20,062.15","20,270.00",134.45,0.67,0.7,142.15,"21,050.00","16,000.00",7.36,2.57

In [25]:
df.describe()

           Change   %Change  365 Days % Change  30 Days % Change
count    9.000000  9.000000           9.000000          9.000000
mean    42.622222  1.783333           0.725556          1.707778
std    106.385573  1.832082          21.466988          4.066174
min   -186.200000 -1.010000         -35.860000         -5.200000
25%      8.800000  0.690000         -10.470000          0.220000
50%     38.350000  0.990000           0.960000          1.450000
75%    134.450000  3.340000           9.540000          2.570000
max    163.450000  4.880000          32.140000          7.630000

In [26]:
df.mean()

C:\Users\mansh\AppData\Local\Temp\ipykernel_8552\3698961737.py:1: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  df.mean()

Change               42.622222
%Change               1.783333
365 Days % Change     0.725556
30 Days % Change      1.707778
dtype: float64

In [27]:
df['Open'].max()

'992'

# WRITING CSV FILE

In [28]:
df = pd.DataFrame([[1,2,3,4],[5,6,7,8],[9,10,11,12],[13,14,15,16],[17,18,19,20]], index=['A','B','C','D','E'], columns=['1','2','3','4'])
df

    1   2   3   4
A   1   2   3   4
B   5   6   7   8
C   9  10  11  12
D  13  14  15  16
E  17  18  19  20

In [29]:
df.to_csv('export.csv')

In [30]:
df.to_csv('export1.csv', columns=['1','2'])